#include <iostream>

using namespace std;

const int N = 10; //константа для задания размера массива
int main()
{

    int arr[50];            //объявление целочисленного массива на 50 значений
    short int arr_const[N]; //объявление целочисленного массива на 10 значений
    double weight[80];      //объявление вещественного массива на 10 значений
    bool checks[5];         //объявление булевого массива на 10 значений
    char rez[200];          //объявление символьного массива на 10 значений
}