#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    // Ipv4 = 32 бита (4 квадранта)
    // Каждый квдрант - [0 - 255]
    // 127.0.0.1
    // 192.168.12.47
    // 192.168.0.340 - не мб

    // Ip адрес: Net id (адрес сети) + Host (номер компа)
    // Маска разделает Ip адрес на сеть и хост (сначала идут 1, а потом все 0)
    // 11111111 11111111 11111111 10000000 - 255.255.255.128

    // Ipv4 & Mask = Адрес сети
    // 192.           168.               12.          47
    // 11000000       10101000        000001100     00101111
    //&
    // 11111111       11111111         11111111     10000000
    //-----------------------------------------------------------
    // 11000000       10101000         000001100    00000000 - адрес сети
    // 192.168.12.0

    // найти 3 байт слева адреса сети, если ip: 240.34.156.34, а маска 255.255.240.0 /20
    cout << (240 & 255) << "." << (34 & 255) << "." << (156 & 240) << "." << (34 & 0) << endl;
}