#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    int val1 = 25178144; // 00000001 10000000 00110000 00100000

    int val2 = val1;
    int val3 = val1;
    int val4 = val1;
    //  00100000 00000000 00000000 00000000
    //  00000000 00000000 00000000 00100000
    //  вывести значение (10 сс) последнего байта переменной val1
    int temp = val1 << 24;
    val1 = temp >> 24;
    cout << val1 << endl;

    //  вывести предпоследнее значение (10 сс) последнего байта переменной val1 (24)
    // 00000001 10000000 00110000 00100000
    // 00110000 00100000 00000000 00000000
    // 00000000 00100000 00000000 00110000
    temp = val2 << 16;
    val2 = temp >> 24;
    cout << val2 << endl;

    //  вывести значение (10 сс) второго байта переменной val1 с начала (128)
    // 00000001 10000000 00110000 00100000
    // 10000000 00110000 00100000 00000000
    // 10000000 00100000 00000000 10000000
    temp = val3 << 8;
    val3 = temp >> 24;
    cout << fabs(val3) << endl;

    // Первый байт слева у числа отвечает за знак 1 (отриц), а 0 положит
    val4 >>= 24;
    cout << (val4) << endl;
}