#include <iostream>
#include <cmath>
#include <iomanip>
using namespace std;

int main(){

//написать программу для того, чтобы польщователь отгадал дату и месяц рождения другого человека

unsigned short int mes, day;

cin >> mes >> day;

if (mes == 3){

    if(day == 24) cout <<"Угадали месяц и день";
    else cout <<"Угадали ток месяц";
}
else cout <<"Ничего не угадали";


//месяц ы году
//ввод значен
// 1 - Январь
// 2 - Фев
// 3 - дек



}